MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS705/mcu.h
#define PGA2CON PGA2CON
extern volatile uint16_t PGA2CON __attribute__((__sfr__));
__extension__ typedef struct tagPGA2CONBITS {
  union {
    struct {
      uint16_t GAIN:3;
      uint16_t :5;
      uint16_t SELNI:3;
      uint16_t SELPI:3;
      uint16_t PGAOEN:1;
      uint16_t PGAEN:1;
    };
    struct {
      uint16_t GAIN0:1;
      uint16_t GAIN1:1;
      uint16_t GAIN2:1;
      uint16_t :5;
      uint16_t SELNI0:1;
      uint16_t SELNI1:1;
      uint16_t SELNI2:1;
      uint16_t SELPI0:1;
      uint16_t SELPI1:1;
      uint16_t SELPI2:1;
    };
  };
} PGA2CONBITS;
extern volatile PGA2CONBITS PGA2CONbits __attribute__((__sfr__));

#define PGA2CAL PGA2CAL
extern volatile uint16_t PGA2CAL __attribute__((__sfr__));
typedef struct tagPGA2CALBITS {
  uint16_t PGACAL:6;
} PGA2CALBITS;
extern volatile PGA2CALBITS PGA2CALbits __attribute__((__sfr__));

#define CMP1CON CMP1CON
extern volatile uint16_t CMP1CON __attribute__((__sfr__));
__extension__ typedef struct tagCMP1CONBITS {
  union {
    struct {
      uint16_t RANGE:1;
      uint16_t CMPPOL:1;
      uint16_t ALTINP:1;
      uint16_t CMPSTAT:1;
      uint16_t HYSPOL:1;
      uint16_t EXTREF:1;
      uint16_t INSEL:2;
      uint16_t DACOE:1;
      uint16_t FCLKSEL:1;
      uint16_t FLTREN:1;
      uint16_t HYSSEL:2;
      uint16_t CMPSIDL:1;
      uint16_t :1;
      uint16_t CMPON:1;
    };
    struct {
      uint16_t :6;
      uint16_t INSEL0:1;
      uint16_t INSEL1:1;
      uint16_t :3;
      uint16_t HYSSEL0:1;
      uint16_t HYSSEL1:1;
    };
  };
} CMP1CONBITS;
extern volatile CMP1CONBITS CMP1CONbits __attribute__((__sfr__));

#define CMP1DAC CMP1DAC
extern volatile uint16_t CMP1DAC __attribute__((__sfr__));
__extension__ typedef struct tagCMP1DACBITS {
  union {
    struct {
      uint16_t CMREF:12;
    };
    struct {
      uint16_t CMREF0:1;
      uint16_t CMREF1:1;
      uint16_t CMREF2:1;
      uint16_t CMREF3:1;
      uint16_t CMREF4:1;
      uint16_t CMREF5:1;
      uint16_t CMREF6:1;
      uint16_t CMREF7:1;
      uint16_t CMREF8:1;
      uint16_t CMREF9:1;
      uint16_t CMREF10:1;
      uint16_t CMREF11:1;
    };
  };
} CMP1DACBITS;
extern volatile CMP1DACBITS CMP1DACbits __attribute__((__sfr__));

#define CMP2CON CMP2CON
extern volatile uint16_t CMP2CON __attribute__((__sfr__));
__extension__ typedef struct tagCMP2CONBITS {
  union {
    struct {
      uint16_t RANGE:1;
      uint16_t CMPPOL:1;
      uint16_t ALTINP:1;
      uint16_t CMPSTAT:1;
      uint16_t HYSPOL:1;
      uint16_t EXTREF:1;
      uint16_t INSEL:2;
      uint16_t DACOE:1;
      uint16_t FCLKSEL:1;
      uint16_t FLTREN:1;
      uint16_t HYSSEL:2;
      uint16_t CMPSIDL:1;
      uint16_t :1;
      uint16_t CMPON:1;
    };
    struct {
      uint16_t :6;
      uint16_t INSEL0:1;
      uint16_t INSEL1:1;
      uint16_t :3;
      uint16_t HYSSEL0:1;
      uint16_t HYSSEL1:1;
    };
  };
} CMP2CONBITS;
extern volatile CMP2CONBITS CMP2CONbits __attribute__((__sfr__));

#define CMP2DAC CMP2DAC
extern volatile uint16_t CMP2DAC __attribute__((__sfr__));
__extension__ typedef struct tagCMP2DACBITS {
  union {
    struct {
      uint16_t CMREF:12;
    };
    struct {
      uint16_t CMREF0:1;
      uint16_t CMREF1:1;
      uint16_t CMREF2:1;
      uint16_t CMREF3:1;
      uint16_t CMREF4:1;
      uint16_t CMREF5:1;
      uint16_t CMREF6:1;
      uint16_t CMREF7:1;
      uint16_t CMREF8:1;
      uint16_t CMREF9:1;
      uint16_t CMREF10:1;
      uint16_t CMREF11:1;
    };
  };
} CMP2DACBITS;
extern volatile CMP2DACBITS CMP2DACbits __attribute__((__sfr__));

#define CMP3CON CMP3CON
extern volatile uint16_t CMP3CON __attribute__((__sfr__));
__extension__ typedef struct tagCMP3CONBITS {
  union {
    struct {
      uint16_t RANGE:1;
      uint16_t CMPPOL:1;
      uint16_t ALTINP:1;
      uint16_t CMPSTAT:1;
      uint16_t HYSPOL:1;
      uint16_t EXTREF:1;
      uint16_t INSEL:2;
      uint16_t DACOE:1;
      uint16_t FCLKSEL:1;
      uint16_t FLTREN:1;
      uint16_t HYSSEL:2;
      uint16_t CMPSIDL:1;
      uint16_t :1;
      uint16_t CMPON:1;
    };
    struct {
      uint16_t :6;
      uint16_t INSEL0:1;
      uint16_t INSEL1:1;
      uint16_t :3;
      uint16_t HYSSEL0:1;
      uint16_t HYSSEL1:1;
    };
  };
} CMP3CONBITS;
extern volatile CMP3CONBITS CMP3CONbits __attribute__((__sfr__));

#define CMP3DAC CMP3DAC
extern volatile uint16_t CMP3DAC __attribute__((__sfr__));
__extension__ typedef struct tagCMP3DACBITS {
  union {
    struct {
      uint16_t CMREF:12;
    };
    struct {
      uint16_t CMREF0:1;
      uint16_t CMREF1:1;
      uint16_t CMREF2:1;
      uint16_t CMREF3:1;
      uint16_t CMREF4:1;
      uint16_t CMREF5:1;
      uint16_t CMREF6:1;
      uint16_t CMREF7:1;
      uint16_t CMREF8:1;
      uint16_t CMREF9:1;
      uint16_t CMREF10:1;
      uint16_t CMREF11:1;
    };
  };
} CMP3DACBITS;
extern volatile CMP3DACBITS CMP3DACbits __attribute__((__sfr__));

#define CMP4CON CMP4CON
extern volatile uint16_t CMP4CON __attribute__((__sfr__));
__extension__ typedef struct tagCMP4CONBITS {
  union {
    struct {
      uint16_t RANGE:1;
      uint16_t CMPPOL:1;
      uint16_t ALTINP:1;
      uint16_t CMPSTAT:1;
      uint16_t HYSPOL:1;
      uint16_t EXTREF:1;
      uint16_t INSEL:2;
      uint16_t DACOE:1;
      uint16_t FCLKSEL:1;
      uint16_t FLTREN:1;
      uint16_t HYSSEL:2;
      uint16_t CMPSIDL:1;
      uint16_t :1;
      uint16_t CMPON:1;
    };
    struct {
      uint16_t :6;
      uint16_t INSEL0:1;
      uint16_t INSEL1:1;
      uint16_t :3;
      uint16_t HYSSEL0:1;
      uint16_t HYSSEL1:1;
    };
  };
} CMP4CONBITS;
extern volatile CMP4CONBITS CMP4CONbits __attribute__((__sfr__));

#define CMP4DAC CMP4DAC
extern volatile uint16_t CMP4DAC __attribute__((__sfr__));
__extension__ typedef struct tagCMP4DACBITS {
  union {
    struct {
      uint16_t CMREF:12;
    };
    struct {
      uint16_t CMREF0:1;
      uint16_t CMREF1:1;
      uint16_t CMREF2:1;
      uint16_t CMREF3:1;
      uint16_t CMREF4:1;
      uint16_t CMREF5:1;
      uint16_t CMREF6:1;
      uint16_t CMREF7:1;
      uint16_t CMREF8:1;
      uint16_t CMREF9:1;
      uint16_t CMREF10:1;
      uint16_t CMREF11:1;
    };
  };
} CMP4DACBITS;
extern volatile CMP4DACBITS CMP4DACbits __attribute__((__sfr__));

#define SPI3CON1 SPI3CON1
extern volatile uint16_t SPI3CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSPI3CON1BITS {
  union {
    struct {
      uint16_t ENHBUF:1;
      uint16_t SPIFE:1;
      uint16_t MCLKEN:1;
      uint16_t DISSCK:1;
      uint16_t DISSDI:1;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t MODE32:1;
      uint16_t DISSDO:1;
      uint16_t SPISIDL:1;
      uint16_t :1;
      uint16_t SPIEN:1;
    };
    struct {
      uint16_t :10;
      uint16_t MODE:2;
    };
  };
} SPI3CON1BITS;
extern volatile SPI3CON1BITS SPI3CON1bits __attribute__((__sfr__));

#define SPI3CON1L SPI3CON1L
extern volatile uint16_t SPI3CON1L __attribute__((__sfr__));
__extension__ typedef struct tagSPI3CON1LBITS {
  union {
    struct {
      uint16_t ENHBUF:1;
      uint16_t SPIFE:1;
      uint16_t MCLKEN:1;
      uint16_t DISSCK:1;
      uint16_t DISSDI:1;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t MODE32:1;
      uint16_t DISSDO:1;
      uint16_t SPISIDL:1;
      uint16_t :1;
      uint16_t SPIEN:1;
    };
    struct {
      uint16_t :10;
      uint16_t MODE:2;
    };
  };
} SPI3CON1LBITS;
extern volatile SPI3CON1LBITS SPI3CON1Lbits __attribute__((__sfr__));

#define SPI3CON1H SPI3CON1H
extern volatile uint16_t SPI3CON1H __attribute__((__sfr__));
__extension__ typedef struct tagSPI3CON1HBITS {
  union {
    struct {
      uint16_t FRMCNT:3;
      uint16_t FRMSYPW:1;
      uint16_t MSSEN:1;
      uint16_t FRMPOL:1;
      uint16_t FRMSYNC:1;
      uint16_t FRMEN:1;
      uint16_t AUDMOD:2;
      uint16_t URDTEN:1;
      uint16_t AUDMONO:1;
      uint16_t IGNTUR:1;
      uint16_t IGNROV:1;
      uint16_t SPISGNEXT:1;
      uint16_t AUDEN:1;
    };
    struct {
      uint16_t FRMCNT0:1;
      uint16_t FRMCNT1:1;
      uint16_t FRMCNT2:1;
      uint16_t :5;
      uint16_t AUDMOD0:1;
      uint16_t AUDMOD1:1;
    };
  };
} SPI3CON1HBITS;
extern volatile SPI3CON1HBITS SPI3CON1Hbits __attribute__((__sfr__));

