MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS705/mcu.h
#define LEBDLY7 LEBDLY7
extern volatile uint16_t LEBDLY7 __attribute__((__sfr__));
__extension__ typedef struct tagLEBDLY7BITS {
  union {
    struct {
      uint16_t :3;
      uint16_t LEB:9;
    };
    struct {
      uint16_t :3;
      uint16_t LEB0:1;
      uint16_t LEB1:1;
      uint16_t LEB2:1;
      uint16_t LEB3:1;
      uint16_t LEB4:1;
      uint16_t LEB5:1;
      uint16_t LEB6:1;
      uint16_t LEB7:1;
      uint16_t LEB8:1;
    };
  };
} LEBDLY7BITS;
extern volatile LEBDLY7BITS LEBDLY7bits __attribute__((__sfr__));

#define AUXCON7 AUXCON7
extern volatile uint16_t AUXCON7 __attribute__((__sfr__));
__extension__ typedef struct tagAUXCON7BITS {
  union {
    struct {
      uint16_t CHOPLEN:1;
      uint16_t CHOPHEN:1;
      uint16_t CHOPSEL:4;
      uint16_t :2;
      uint16_t BLANKSEL:4;
      uint16_t :2;
      uint16_t HRDDIS:1;
      uint16_t HRPDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t CHOPSEL0:1;
      uint16_t CHOPSEL1:1;
      uint16_t CHOPSEL2:1;
      uint16_t CHOPSEL3:1;
      uint16_t :2;
      uint16_t BLANKSEL0:1;
      uint16_t BLANKSEL1:1;
      uint16_t BLANKSEL2:1;
      uint16_t BLANKSEL3:1;
    };
  };
} AUXCON7BITS;
extern volatile AUXCON7BITS AUXCON7bits __attribute__((__sfr__));

#define PWMCON8 PWMCON8
extern volatile uint16_t PWMCON8 __attribute__((__sfr__));
__extension__ typedef struct tagPWMCON8BITS {
  union {
    struct {
      uint16_t IUE:1;
      uint16_t XPRES:1;
      uint16_t CAM:1;
      uint16_t MTBS:1;
      uint16_t :2;
      uint16_t DTC:2;
      uint16_t MDCS:1;
      uint16_t ITB:1;
      uint16_t TRGIEN:1;
      uint16_t CLIEN:1;
      uint16_t FLTIEN:1;
      uint16_t TRGSTAT:1;
      uint16_t CLSTAT:1;
      uint16_t FLTSTAT:1;
    };
    struct {
      uint16_t :6;
      uint16_t DTC0:1;
      uint16_t DTC1:1;
    };
  };
} PWMCON8BITS;
extern volatile PWMCON8BITS PWMCON8bits __attribute__((__sfr__));

#define IOCON8 IOCON8
extern volatile uint16_t IOCON8 __attribute__((__sfr__));
__extension__ typedef struct tagIOCON8BITS {
  union {
    struct {
      uint16_t OSYNC:1;
      uint16_t SWAP:1;
      uint16_t CLDAT:2;
      uint16_t FLTDAT:2;
      uint16_t OVRDAT:2;
      uint16_t OVRENL:1;
      uint16_t OVRENH:1;
      uint16_t PMOD:2;
      uint16_t POLL:1;
      uint16_t POLH:1;
      uint16_t PENL:1;
      uint16_t PENH:1;
    };
    struct {
      uint16_t :2;
      uint16_t CLDAT0:1;
      uint16_t CLDAT1:1;
      uint16_t FLTDAT0:1;
      uint16_t FLTDAT1:1;
      uint16_t OVRDAT0:1;
      uint16_t OVRDAT1:1;
      uint16_t :2;
      uint16_t PMOD0:1;
      uint16_t PMOD1:1;
    };
  };
} IOCON8BITS;
extern volatile IOCON8BITS IOCON8bits __attribute__((__sfr__));

#define FCLCON8 FCLCON8
extern volatile uint16_t FCLCON8 __attribute__((__sfr__));
__extension__ typedef struct tagFCLCON8BITS {
  union {
    struct {
      uint16_t FLTMOD:2;
      uint16_t FLTPOL:1;
      uint16_t FLTSRC:5;
      uint16_t CLMOD:1;
      uint16_t CLPOL:1;
      uint16_t CLSRC:5;
      uint16_t IFLTMOD:1;
    };
    struct {
      uint16_t FLTMOD0:1;
      uint16_t FLTMOD1:1;
      uint16_t :1;
      uint16_t FLTSRC0:1;
      uint16_t FLTSRC1:1;
      uint16_t FLTSRC2:1;
      uint16_t FLTSRC3:1;
      uint16_t FLTSRC4:1;
      uint16_t :2;
      uint16_t CLSRC0:1;
      uint16_t CLSRC1:1;
      uint16_t CLSRC2:1;
      uint16_t CLSRC3:1;
      uint16_t CLSRC4:1;
    };
  };
} FCLCON8BITS;
extern volatile FCLCON8BITS FCLCON8bits __attribute__((__sfr__));

#define PDC8 PDC8
extern volatile uint16_t PDC8 __attribute__((__sfr__));
#define PHASE8 PHASE8
extern volatile uint16_t PHASE8 __attribute__((__sfr__));
#define DTR8 DTR8
extern volatile uint16_t DTR8 __attribute__((__sfr__));
#define ALTDTR8 ALTDTR8
extern volatile uint16_t ALTDTR8 __attribute__((__sfr__));
#define SDC8 SDC8
extern volatile uint16_t SDC8 __attribute__((__sfr__));
#define SPHASE8 SPHASE8
extern volatile uint16_t SPHASE8 __attribute__((__sfr__));
#define TRIG8 TRIG8
extern volatile uint16_t TRIG8 __attribute__((__sfr__));
__extension__ typedef struct tagTRIG8BITS {
  union {
    struct {
      uint16_t :3;
      uint16_t TRGCMP:13;
    };
    struct {
      uint16_t :3;
      uint16_t TRGCMP0:1;
      uint16_t TRGCMP1:1;
      uint16_t TRGCMP2:1;
      uint16_t TRGCMP3:1;
      uint16_t TRGCMP4:1;
      uint16_t TRGCMP5:1;
      uint16_t TRGCMP6:1;
      uint16_t TRGCMP7:1;
      uint16_t TRGCMP8:1;
      uint16_t TRGCMP9:1;
      uint16_t TRGCMP10:1;
      uint16_t TRGCMP11:1;
      uint16_t TRGCMP12:1;
    };
  };
} TRIG8BITS;
extern volatile TRIG8BITS TRIG8bits __attribute__((__sfr__));

#define TRGCON8 TRGCON8
extern volatile uint16_t TRGCON8 __attribute__((__sfr__));
__extension__ typedef struct tagTRGCON8BITS {
  union {
    struct {
      uint16_t TRGSTRT:6;
      uint16_t :1;
      uint16_t DTM:1;
      uint16_t :4;
      uint16_t TRGDIV:4;
    };
    struct {
      uint16_t TRGSTRT0:1;
      uint16_t TRGSTRT1:1;
      uint16_t TRGSTRT2:1;
      uint16_t TRGSTRT3:1;
      uint16_t TRGSTRT4:1;
      uint16_t TRGSTRT5:1;
      uint16_t :6;
      uint16_t TRGDIV0:1;
      uint16_t TRGDIV1:1;
      uint16_t TRGDIV2:1;
      uint16_t TRGDIV3:1;
    };
  };
} TRGCON8BITS;
extern volatile TRGCON8BITS TRGCON8bits __attribute__((__sfr__));

#define STRIG8 STRIG8
extern volatile uint16_t STRIG8 __attribute__((__sfr__));
__extension__ typedef struct tagSTRIG8BITS {
  union {
    struct {
      uint16_t :3;
      uint16_t STRGCMP:13;
    };
    struct {
      uint16_t :3;
      uint16_t STRGCMP0:1;
      uint16_t STRGCMP1:1;
      uint16_t STRGCMP2:1;
      uint16_t STRGCMP3:1;
      uint16_t STRGCMP4:1;
      uint16_t STRGCMP5:1;
      uint16_t STRGCMP6:1;
      uint16_t STRGCMP7:1;
      uint16_t STRGCMP8:1;
      uint16_t STRGCMP9:1;
      uint16_t STRGCMP10:1;
      uint16_t STRGCMP11:1;
      uint16_t STRGCMP12:1;
    };
  };
} STRIG8BITS;
extern volatile STRIG8BITS STRIG8bits __attribute__((__sfr__));

#define PWMCAP8 PWMCAP8
extern volatile uint16_t PWMCAP8 __attribute__((__sfr__));
__extension__ typedef struct tagPWMCAP8BITS {
  union {
    struct {
      uint16_t :3;
      uint16_t PWMCAP:13;
    };
    struct {
      uint16_t :3;
      uint16_t PWMCAP0:1;
      uint16_t PWMCAP1:1;
      uint16_t PWMCAP2:1;
      uint16_t PWMCAP3:1;
      uint16_t PWMCAP4:1;
      uint16_t PWMCAP5:1;
      uint16_t PWMCAP6:1;
      uint16_t PWMCAP7:1;
      uint16_t PWMCAP8:1;
      uint16_t PWMCAP9:1;
      uint16_t PWMCAP10:1;
      uint16_t PWMCAP11:1;
      uint16_t PWMCAP12:1;
    };
  };
} PWMCAP8BITS;
extern volatile PWMCAP8BITS PWMCAP8bits __attribute__((__sfr__));

#define LEBCON8 LEBCON8
extern volatile uint16_t LEBCON8 __attribute__((__sfr__));
typedef struct tagLEBCON8BITS {
  uint16_t BPLL:1;
  uint16_t BPLH:1;
  uint16_t BPHL:1;
  uint16_t BPHH:1;
  uint16_t BCL:1;
  uint16_t BCH:1;
  uint16_t :4;
  uint16_t CLLEBEN:1;
  uint16_t FLTLEBEN:1;
  uint16_t PLF:1;
  uint16_t PLR:1;
  uint16_t PHF:1;
  uint16_t PHR:1;
} LEBCON8BITS;
extern volatile LEBCON8BITS LEBCON8bits __attribute__((__sfr__));

