MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS705/mcu.h
#define _SPI1CON2_IGNROV_POSITION                0x0000000D
#define _SPI1CON2_IGNROV_MASK                    0x00002000
#define _SPI1CON2_IGNROV_LENGTH                  0x00000001

#define _SPI1CON2_SPISGNEXT_POSITION             0x0000000E
#define _SPI1CON2_SPISGNEXT_MASK                 0x00004000
#define _SPI1CON2_SPISGNEXT_LENGTH               0x00000001

#define _SPI1CON2_AUDEN_POSITION                 0x0000000F
#define _SPI1CON2_AUDEN_MASK                     0x00008000
#define _SPI1CON2_AUDEN_LENGTH                   0x00000001

#define _SPI1CON2_FRMCNT0_POSITION               0x00000000
#define _SPI1CON2_FRMCNT0_MASK                   0x00000001
#define _SPI1CON2_FRMCNT0_LENGTH                 0x00000001

#define _SPI1CON2_FRMCNT1_POSITION               0x00000001
#define _SPI1CON2_FRMCNT1_MASK                   0x00000002
#define _SPI1CON2_FRMCNT1_LENGTH                 0x00000001

#define _SPI1CON2_FRMCNT2_POSITION               0x00000002
#define _SPI1CON2_FRMCNT2_MASK                   0x00000004
#define _SPI1CON2_FRMCNT2_LENGTH                 0x00000001

#define _SPI1CON2_AUDMOD0_POSITION               0x00000008
#define _SPI1CON2_AUDMOD0_MASK                   0x00000100
#define _SPI1CON2_AUDMOD0_LENGTH                 0x00000001

#define _SPI1CON2_AUDMOD1_POSITION               0x00000009
#define _SPI1CON2_AUDMOD1_MASK                   0x00000200
#define _SPI1CON2_AUDMOD1_LENGTH                 0x00000001

#define _SPI1CON2L_WLENGTH_POSITION              0x00000000
#define _SPI1CON2L_WLENGTH_MASK                  0x0000001F
#define _SPI1CON2L_WLENGTH_LENGTH                0x00000005

#define _SPI1CON3_WLENGTH_POSITION               0x00000000
#define _SPI1CON3_WLENGTH_MASK                   0x0000001F
#define _SPI1CON3_WLENGTH_LENGTH                 0x00000005

#define _SPI1STATL_SPIRBF_POSITION               0x00000000
#define _SPI1STATL_SPIRBF_MASK                   0x00000001
#define _SPI1STATL_SPIRBF_LENGTH                 0x00000001

#define _SPI1STATL_SPITBF_POSITION               0x00000001
#define _SPI1STATL_SPITBF_MASK                   0x00000002
#define _SPI1STATL_SPITBF_LENGTH                 0x00000001

#define _SPI1STATL_SPITBE_POSITION               0x00000003
#define _SPI1STATL_SPITBE_MASK                   0x00000008
#define _SPI1STATL_SPITBE_LENGTH                 0x00000001

#define _SPI1STATL_SPIRBE_POSITION               0x00000005
#define _SPI1STATL_SPIRBE_MASK                   0x00000020
#define _SPI1STATL_SPIRBE_LENGTH                 0x00000001

#define _SPI1STATL_SPIROV_POSITION               0x00000006
#define _SPI1STATL_SPIROV_MASK                   0x00000040
#define _SPI1STATL_SPIROV_LENGTH                 0x00000001

#define _SPI1STATL_SRMT_POSITION                 0x00000007
#define _SPI1STATL_SRMT_MASK                     0x00000080
#define _SPI1STATL_SRMT_LENGTH                   0x00000001

#define _SPI1STATL_SPITUR_POSITION               0x00000008
#define _SPI1STATL_SPITUR_MASK                   0x00000100
#define _SPI1STATL_SPITUR_LENGTH                 0x00000001

#define _SPI1STATL_SPIBUSY_POSITION              0x0000000B
#define _SPI1STATL_SPIBUSY_MASK                  0x00000800
#define _SPI1STATL_SPIBUSY_LENGTH                0x00000001

#define _SPI1STATL_FRMERR_POSITION               0x0000000C
#define _SPI1STATL_FRMERR_MASK                   0x00001000
#define _SPI1STATL_FRMERR_LENGTH                 0x00000001

#define _SPI1STATH_TXELM_POSITION                0x00000000
#define _SPI1STATH_TXELM_MASK                    0x0000003F
#define _SPI1STATH_TXELM_LENGTH                  0x00000006

#define _SPI1STATH_RXELM_POSITION                0x00000008
#define _SPI1STATH_RXELM_MASK                    0x00003F00
#define _SPI1STATH_RXELM_LENGTH                  0x00000006

#define _SPI1STATH_TXELM0_POSITION               0x00000000
#define _SPI1STATH_TXELM0_MASK                   0x00000001
#define _SPI1STATH_TXELM0_LENGTH                 0x00000001

#define _SPI1STATH_TXELM1_POSITION               0x00000001
#define _SPI1STATH_TXELM1_MASK                   0x00000002
#define _SPI1STATH_TXELM1_LENGTH                 0x00000001

#define _SPI1STATH_TXELM2_POSITION               0x00000002
#define _SPI1STATH_TXELM2_MASK                   0x00000004
#define _SPI1STATH_TXELM2_LENGTH                 0x00000001

#define _SPI1STATH_TXELM3_POSITION               0x00000003
#define _SPI1STATH_TXELM3_MASK                   0x00000008
#define _SPI1STATH_TXELM3_LENGTH                 0x00000001

#define _SPI1STATH_TXELM4_POSITION               0x00000004
#define _SPI1STATH_TXELM4_MASK                   0x00000010
#define _SPI1STATH_TXELM4_LENGTH                 0x00000001

#define _SPI1STATH_TXELM5_POSITION               0x00000005
#define _SPI1STATH_TXELM5_MASK                   0x00000020
#define _SPI1STATH_TXELM5_LENGTH                 0x00000001

#define _SPI1STATH_RXELM0_POSITION               0x00000008
#define _SPI1STATH_RXELM0_MASK                   0x00000100
#define _SPI1STATH_RXELM0_LENGTH                 0x00000001

#define _SPI1STATH_RXELM1_POSITION               0x00000009
#define _SPI1STATH_RXELM1_MASK                   0x00000200
#define _SPI1STATH_RXELM1_LENGTH                 0x00000001

#define _SPI1STATH_RXELM2_POSITION               0x0000000A
#define _SPI1STATH_RXELM2_MASK                   0x00000400
#define _SPI1STATH_RXELM2_LENGTH                 0x00000001

#define _SPI1STATH_RXELM3_POSITION               0x0000000B
#define _SPI1STATH_RXELM3_MASK                   0x00000800
#define _SPI1STATH_RXELM3_LENGTH                 0x00000001

#define _SPI1STATH_RXELM4_POSITION               0x0000000C
#define _SPI1STATH_RXELM4_MASK                   0x00001000
#define _SPI1STATH_RXELM4_LENGTH                 0x00000001

#define _SPI1STATH_RXELM5_POSITION               0x0000000D
#define _SPI1STATH_RXELM5_MASK                   0x00002000
#define _SPI1STATH_RXELM5_LENGTH                 0x00000001

#define _SPI1BUFL_SPI1BUFL_POSITION              0x00000000
#define _SPI1BUFL_SPI1BUFL_MASK                  0x0000FFFF
#define _SPI1BUFL_SPI1BUFL_LENGTH                0x00000010

#define _SPI1BUFL_DATA_POSITION                  0x00000000
#define _SPI1BUFL_DATA_MASK                      0x0000FFFF
#define _SPI1BUFL_DATA_LENGTH                    0x00000010

#define _SPI1BUFH_SPI1BUFH_POSITION              0x00000000
#define _SPI1BUFH_SPI1BUFH_MASK                  0x0000FFFF
#define _SPI1BUFH_SPI1BUFH_LENGTH                0x00000010

