MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS705/mcu.h
#define _STRIG7_STRGCMP9_POSITION                0x0000000C
#define _STRIG7_STRGCMP9_MASK                    0x00001000
#define _STRIG7_STRGCMP9_LENGTH                  0x00000001

#define _STRIG7_STRGCMP10_POSITION               0x0000000D
#define _STRIG7_STRGCMP10_MASK                   0x00002000
#define _STRIG7_STRGCMP10_LENGTH                 0x00000001

#define _STRIG7_STRGCMP11_POSITION               0x0000000E
#define _STRIG7_STRGCMP11_MASK                   0x00004000
#define _STRIG7_STRGCMP11_LENGTH                 0x00000001

#define _STRIG7_STRGCMP12_POSITION               0x0000000F
#define _STRIG7_STRGCMP12_MASK                   0x00008000
#define _STRIG7_STRGCMP12_LENGTH                 0x00000001

#define _PWMCAP7_PWMCAP_POSITION                 0x00000003
#define _PWMCAP7_PWMCAP_MASK                     0x0000FFF8
#define _PWMCAP7_PWMCAP_LENGTH                   0x0000000D

#define _PWMCAP7_PWMCAP0_POSITION                0x00000003
#define _PWMCAP7_PWMCAP0_MASK                    0x00000008
#define _PWMCAP7_PWMCAP0_LENGTH                  0x00000001

#define _PWMCAP7_PWMCAP1_POSITION                0x00000004
#define _PWMCAP7_PWMCAP1_MASK                    0x00000010
#define _PWMCAP7_PWMCAP1_LENGTH                  0x00000001

#define _PWMCAP7_PWMCAP2_POSITION                0x00000005
#define _PWMCAP7_PWMCAP2_MASK                    0x00000020
#define _PWMCAP7_PWMCAP2_LENGTH                  0x00000001

#define _PWMCAP7_PWMCAP3_POSITION                0x00000006
#define _PWMCAP7_PWMCAP3_MASK                    0x00000040
#define _PWMCAP7_PWMCAP3_LENGTH                  0x00000001

#define _PWMCAP7_PWMCAP4_POSITION                0x00000007
#define _PWMCAP7_PWMCAP4_MASK                    0x00000080
#define _PWMCAP7_PWMCAP4_LENGTH                  0x00000001

#define _PWMCAP7_PWMCAP5_POSITION                0x00000008
#define _PWMCAP7_PWMCAP5_MASK                    0x00000100
#define _PWMCAP7_PWMCAP5_LENGTH                  0x00000001

#define _PWMCAP7_PWMCAP6_POSITION                0x00000009
#define _PWMCAP7_PWMCAP6_MASK                    0x00000200
#define _PWMCAP7_PWMCAP6_LENGTH                  0x00000001

#define _PWMCAP7_PWMCAP7_POSITION                0x0000000A
#define _PWMCAP7_PWMCAP7_MASK                    0x00000400
#define _PWMCAP7_PWMCAP7_LENGTH                  0x00000001

#define _PWMCAP7_PWMCAP8_POSITION                0x0000000B
#define _PWMCAP7_PWMCAP8_MASK                    0x00000800
#define _PWMCAP7_PWMCAP8_LENGTH                  0x00000001

#define _PWMCAP7_PWMCAP9_POSITION                0x0000000C
#define _PWMCAP7_PWMCAP9_MASK                    0x00001000
#define _PWMCAP7_PWMCAP9_LENGTH                  0x00000001

#define _PWMCAP7_PWMCAP10_POSITION               0x0000000D
#define _PWMCAP7_PWMCAP10_MASK                   0x00002000
#define _PWMCAP7_PWMCAP10_LENGTH                 0x00000001

#define _PWMCAP7_PWMCAP11_POSITION               0x0000000E
#define _PWMCAP7_PWMCAP11_MASK                   0x00004000
#define _PWMCAP7_PWMCAP11_LENGTH                 0x00000001

#define _PWMCAP7_PWMCAP12_POSITION               0x0000000F
#define _PWMCAP7_PWMCAP12_MASK                   0x00008000
#define _PWMCAP7_PWMCAP12_LENGTH                 0x00000001

#define _LEBCON7_BPLL_POSITION                   0x00000000
#define _LEBCON7_BPLL_MASK                       0x00000001
#define _LEBCON7_BPLL_LENGTH                     0x00000001

#define _LEBCON7_BPLH_POSITION                   0x00000001
#define _LEBCON7_BPLH_MASK                       0x00000002
#define _LEBCON7_BPLH_LENGTH                     0x00000001

#define _LEBCON7_BPHL_POSITION                   0x00000002
#define _LEBCON7_BPHL_MASK                       0x00000004
#define _LEBCON7_BPHL_LENGTH                     0x00000001

#define _LEBCON7_BPHH_POSITION                   0x00000003
#define _LEBCON7_BPHH_MASK                       0x00000008
#define _LEBCON7_BPHH_LENGTH                     0x00000001

#define _LEBCON7_BCL_POSITION                    0x00000004
#define _LEBCON7_BCL_MASK                        0x00000010
#define _LEBCON7_BCL_LENGTH                      0x00000001

#define _LEBCON7_BCH_POSITION                    0x00000005
#define _LEBCON7_BCH_MASK                        0x00000020
#define _LEBCON7_BCH_LENGTH                      0x00000001

#define _LEBCON7_CLLEBEN_POSITION                0x0000000A
#define _LEBCON7_CLLEBEN_MASK                    0x00000400
#define _LEBCON7_CLLEBEN_LENGTH                  0x00000001

#define _LEBCON7_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON7_FLTLEBEN_MASK                   0x00000800
#define _LEBCON7_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON7_PLF_POSITION                    0x0000000C
#define _LEBCON7_PLF_MASK                        0x00001000
#define _LEBCON7_PLF_LENGTH                      0x00000001

#define _LEBCON7_PLR_POSITION                    0x0000000D
#define _LEBCON7_PLR_MASK                        0x00002000
#define _LEBCON7_PLR_LENGTH                      0x00000001

#define _LEBCON7_PHF_POSITION                    0x0000000E
#define _LEBCON7_PHF_MASK                        0x00004000
#define _LEBCON7_PHF_LENGTH                      0x00000001

#define _LEBCON7_PHR_POSITION                    0x0000000F
#define _LEBCON7_PHR_MASK                        0x00008000
#define _LEBCON7_PHR_LENGTH                      0x00000001

#define _LEBDLY7_LEB_POSITION                    0x00000003
#define _LEBDLY7_LEB_MASK                        0x00000FF8
#define _LEBDLY7_LEB_LENGTH                      0x00000009

#define _LEBDLY7_LEB0_POSITION                   0x00000003
#define _LEBDLY7_LEB0_MASK                       0x00000008
#define _LEBDLY7_LEB0_LENGTH                     0x00000001

#define _LEBDLY7_LEB1_POSITION                   0x00000004
#define _LEBDLY7_LEB1_MASK                       0x00000010
#define _LEBDLY7_LEB1_LENGTH                     0x00000001

#define _LEBDLY7_LEB2_POSITION                   0x00000005
#define _LEBDLY7_LEB2_MASK                       0x00000020
#define _LEBDLY7_LEB2_LENGTH                     0x00000001

